// =====================================================================
///                        МАСИВИ та ФУНКЦІЇ  ///
// =====================================================================

// 1. Реалізуйте Result
// const a = ['a', 'b', 'c'];
// const b = [1, [2, 3]];
// const c = 0;
// Result = ['a', 'b', 'c', 0, 1, 2, 3];

// =====================================================

// 2. Реалізуйте Result
// const a = ["a", "b", "c", "d", "e", "f", "g", "h"];
// Result = ["a", "b", "c", "a", "b", "c", "g", "h"];

// =====================================================

// 3. Реалізуйте функцію, яка розгладить масив:
// const arr = [1, 2, [3, 4], [5, 6], 7];

// Result = [1, 2, 3, 4, 5, 6, 7];

// =====================================================

// 4. Напиши функцію, яка повертає останній символ стрічки

// function getLastCharacter(input) {
//   return input[input.length - 1];
// }

// console.log(getLastCharacter("321433530")); // 0

// =====================================================

// 5. Реалізуй функцію, яка приймає рядки або числа і повертає масив з протилежним типом даних:
// convert('1', 2, 3, '4') || [1, '2', '3', 4]

// =====================================================

// 6. Напиши функцію, яка приймає рядок text, та повертає масив усіх великих літер, які є в text в такому ж порядку.
// Приклад:
// getCapitals('Ukraine Everywhere') // ['U', 'E']
// getCapitals('UkraiNe EveRywherE') // ['U', 'N', 'E', 'R', 'E']
// getCapitals("1234M5678A9") // ['M', 'A']

// function getCapitals(string) {
//   // write code here

//   const arr = [];

//   Array.from(string.trim()).forEach((letter) => {
//     if (letter === letter.toUpperCase()) {
//       if (isNaN(letter)) {
//         arr.push(letter);
//       }
//     }
//   });

//   console.log(arr);
//   return arr;
// }

// =====================================================
