// =====================================================================
//
//                       MODULE-5: DOM
//
// =====================================================================

//                                PART-1: Домашки

// function onInputChange(event) {
//   inputEl.value === ""
//     ? (outputEl.textContent = "Anonymous")
//     : (outputEl.textContent = event.currentTarget.value);
// }

//                                PART-1: Домашки

// 1. Что такое DOM?
// 2. DOM это JS?
// 3. Какие бывает ноды?

//                                PART-1: Class work

// Mortgage

// Створіть застосунок в якому буде відображатись список створених клієнтом банків для можливості взяття іпотечного кредиту.

// При клікові на назву банку - буде відображатись його інформація, а саме:
// Назва банку
// Річна відсоткова ставка по іпотеці (interest rate, %)
// Максимальна сума кредиту, яку надає банк (Max loan, $)
// Мінімальний платіж (Min payment, $)
// Термін кредиту (Loan term).

// Якщо доданих банків не має - показувати заглушку з текстом: “списку банків ще не має і потрібно їх створити”. Для цього потрібно клікнути по кнопці “Create a new bank”.

// Якщо банки в списку є - то відображати інформацію в слідуючому порядку:
// Назва банку
// Кнопка по редагуванню
// Кнопка по видаленню конкретного банка
// Рендер списку має здійснювати функція renderList().
// Рендер інформації по окремому банку - функція renderInfo().
// Розмітку інформаційного блоку - функція infoMarkup().

// Дизайн довільний. Можете обговорити його із командою. Але стилі повинні бути написані в окремому файлі.
// Ваша початкова html-розмітка має складатись лише з div #root. Це контейнер, куди буде рендеритись уся майбутня розмітка.

const banks = [
  {
    id: 1,
    name: "Mono",
    interestRate: 5,
    maxLoan: 500000,
    minPayment: 1000,
    loanTerm: 12,
  },
  {
    id: 2,
    name: "Privat",
    interestRate: 7,
    maxLoan: 1000000,
    minPayment: 5000,
    loanTerm: 50,
  },
];
