// "use strict";

// Преобразования типов
// -----------------------------------------------------------------
// -----------------------------------------------------------------

// console.log(1 + "1" / 2);
// console.log(10 + +"10" / 2);
// console.log(+false);
// console.log(!!true);
// console.log(+true - +false);
// console.log(!!0);
// console.log(!+"0");
// console.log("Ba" + String(+undefined));
// console.log(+!null + +"10");
// console.log(![].length + "1");
// console.log((true && 10 && false) || 99);
// console.log((!null && 0) || "Hello".length);
// console.log(!![].length || undefined || null || +null || "" || 0 == "0" || NaN);

// -----------------------------------------------------------------
// -----------------------------------------------------------------

// Будет ли ошибка?
// const _ = 10;
// const $ = 10;
// const a45a = 10;
// const a#45 = 10;
// const Привет_я_переменная = 10;
// hello = 10;

// -----------------------------------------------------------------
// -----------------------------------------------------------------

// Разница между let и var
// console.log(a);
// console.log(b);
// var a;
// let b;

// -----------------------------------------------------------------
// -----------------------------------------------------------------

// console.log(typeof null === "object");
// console.log(null instanceof Object);

// const a = null;
// a.value = 10;
// console.log(a.value);

// console.log(typeof [] === "object");
// console.log(typeof NaN === "number");
// console.log(NaN === NaN);

// const func = () => {};
// console.log(typeof func);
// console.log(func instanceof Object);

//
//
//
//
//
//
//
//

// console.log((!+[] + [] + ![]).length);

//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//

// =====================================================================
//                             T A S K
// =====================================================================

// =================================== 1 ==========================================

// Напишите цикл, который:
// - выводит в консоль числа от max до min по убыванию
// - выводит в консоль все четные числа от min до max
// const max = 50;
// const min = 23;

// =================================== 2 ==========================================

// Запитайте у користувача якого він року народження. Поточний рік візьміть за константу.
//    Виведіть через alert повідомлення для юзера з інформацією, яка вказує на його вік.
//    Наприклад: "Ваш вік - хх років"

// const date = new Date();
// console.log(date.getFullYear());

// =================================== 3 ==========================================

// Запитайтесь в юзера радіус кола та виведіть його площу.(число пі - 3.14).
// Площа круга: PI*r**2

// =================================== 4 ==========================================

// Водій їде з середньою швидкістю 50 км в годину.
// Запитайтесь у нього скільки йому ще необхідно часу їхати, та виведіть відстань у км.
// Наприклад, "Плануєма відстань становить 100 км"

// ==================================== 5 =========================================

// Юзер має ввести суму коштів на його картці та ціну за 1 літр бензину.
// За кожен оплачений літр бензину користувач отримує нарахування бонусів - 2%.
// Вивести інфу, яка проінформує скільки бензину він може купити, скільки грошей у нього залишиться
// та який бонус буде йому нараховано.

// ==================================== 6 =========================================

// При завантажені сторінки користувачу пропонується в prompt ввести число.
// Дані добавляются до значення змінної total.

// Операція вводу числа продовжується до того часу, поки юзер не нажме Cancel в prompt.
// Після чого потрібно показати alert з повідомленням "Загальна сума введених чисел дорівнює [число]."

// ==================================== 7 =========================================

// При помощи цикла for додайте все четные числа от   min до max

//const max = 50;
//const min = 0;

// ==================================== 8 =========================================

// Напишите код, который будет спрашивать логин с помощью prompt и логировать результат в консоль браузера

// Если посетитель вводит "Админ", то prompt запрашивает пароль.
// Если ничего не ввели или нажата клавиша Esc вывести строку "Отменено"
// В противном случае вывести строку "Я вас не знаю"

// Пароль проверять так:
// Если введён пароль "Я главный" - то вывести строку "Здравствуйте!"
// Иначе выводить строку "Неверный пароль!"

// const loginInput = prompt("Введите свой логин");

// if (loginInput === "Админ") {
//   const passwordInput = prompt("Введите свой пароль");
//   if (passwordInput) {
//     if (passwordInput === "Я главный") {
//       console.log("Здравствуйте");
//     } else {
//       console.log("Неверный пароль");
//     }
//   } else {
//     console.log("Отменено");
//   }
// } else {
//   console.log("Я вас не знаю!");
// }
