// =====================================================================
//
//                      MODULE-2: МАСИВИ та ФУНКЦІЇ
//
// =====================================================================

// console.log(NaN === NaN);
// console.log(typeof null);
// console.log(Number(undefined));

// ---------------------  1   ------------------------

// Что такое чистая функция?
// let a = 1;

// const foo = (b) => a + b;
// const foo = (a, b) => a + b;

// ---------------------  2   ------------------------
// Что такое функция высшего порядка?

// const foo = (callback) => {
//   callback();
// };

// ---------------------  3. Замикання   ------------------------
// const foo = (a) => (b) => (c) => a + b + c;
// console.log(foo(1)(2)(3));

//--------------------
// const makeCounter = () => {
//   let count = 0;
//   return () => count++;
// };

// let counter = makeCounter();
// let counter2 = makeCounter();

// console.log(counter()); // 0
// console.log(counter()); // 1

// console.log(counter2()); // ?
// console.log(counter2()); // ?

// ---------------------  3. Область видимості   ------------------------

// var myName = "global";

// function func() {
//   console.log("1: ", myName);

//   var myName = "local";
//   console.log("2: ", myName);
// }

// func();

//
//
//

// ================================================================================
//                                  ЗАДАЧІ
// ================================================================================

// =================================== 1 ==========================================
// // Реалізуйте result
// const a = ['a', 'b', 'c'];
// const b = [1, [2, 3]];
// const c = 0;

// console.log(result); // ['a', 'b', 'c', 0, 1, 2, 3]

// =================================== 2 ==========================================
// // Реалізуйте result
// const a = ["a", "b", "c", "d", "e", "f", "g", "h"];
//
// console.log(result); // ["a", "b", "c", "a", "b", "c", "g", "h"]

// =================================== 3 ==========================================
// // Реалізуйте функцію, яка розгладить масив:
// const arr = [1, 2, [3, 4], [5, 6], 7];
//
// console.log(foo(arr)); // [1, 2, 3, 4, 5, 6, 7]

// =================================== 4 ==========================================
// // Напиши функцію, яка повертає останній символ стрічки
// console.log(getLastCharacter("321433530")); // 0

// ************ Solution ************
// function getLastCharacter(input) {
//   return input[input.length - 1];
// }

// =================================== 5 ==========================================
// // Реалізуй функцію, яка приймає тип String або Number і повертає масив з протилежним типом даних:
//
// console.log(convert('1', 2, 3, '4')); // [1, '2', '3', 4]

// =================================== 6 ==========================================
// // Напиши функцію, яка приймає рядок text, та повертає масив усіх великих літер, які є в text
// // в такому ж порядку.
// getCapitals('Ukraine Everywhere') // ['U', 'E']
// getCapitals('UkraiNe EveRywherE') // ['U', 'N', 'E', 'R', 'E']
// getCapitals("1234M5678A9") // ['M', 'A']

// ************ Solution ************
// function getCapitals(string) {
//   // write code here

//   const arr = [];

//   Array.from(string.trim()).forEach((letter) => {
//     if (letter === letter.toUpperCase()) {
//       if (isNaN(letter)) {
//         arr.push(letter);
//       }
//     }
//   });

//   console.log(arr);
//   return arr;
// }
