// "use strict";

// =====================================================================
//
//        BLENDED-1: ЗМІННІ та ТИПИ ДАНИХ. ВІДГАЛУЖЕННЯ та ЦИКЛИ
//
// =====================================================================

// ---------------------  0. Питання   ------------------------

/**
1. Які існують типи даних у JS?
2. Де краще потрібно підключати скрипти в html? Чому?
3. В чому різниця між примітивами та не примітивами?
4. Що таке NaN?
5. Навіщо нам use strict?
6. Що таке область видимості?
7. Що таке hoisting?
8. Що таке функціональний вираз?
9. У чому різниця між == та ===?
10. Що таке властивості та методи в JS?
11. Що таке функція?
*/

// ---------------------  1. Перетворення типів   ------------------------
// console.log(1 + "1" / 2);
// console.log(10 + +"10" / 2);
// console.log(+false);
// console.log(!!true);
// console.log(+true - +false);
// console.log(!!0);
// console.log(!+"0");
// console.log("Ba" + String(+undefined));
// console.log(+!null + +"10");
// console.log(![].length + "1");
// console.log((true && 10 && false) || 99);
// console.log((!null && 0) || "Hello".length);
// console.log(!![].length || undefined || null || +null || "" || 0 == "0" || NaN);

// ----------------------  2. isNaN   ---------------------------------------
// console.log(isNaN(true));
// console.log(Number.isNaN(true));

// console.log(isNaN("true"));
// console.log(Number.isNaN("true"));

// console.log(isNaN(5 - "abc"));
// console.log(Number.isNaN(5 - "abc"));

// ----------------  3. Різниця між let та var   -----------------------------
// console.log(a);
// console.log(b);
// var a;
// let b;

//
//
//

// ================================================================================
//                                  ЗАДАЧІ
// ================================================================================

// =================================== 1 ==========================================
// // Напишіть 3 цикла:
// // 1й цикл: выводить в консоль числа від max до min по зменшеню (убыванию).
// // 2й цикл: виводить в консоль усі парні (четные) числа від min до max.
// // 3й цикл: виводить в консоль суму усіх парних (четных) чисел від min до max
// const max = 50;
// const min = 23;

// =================================== 2 ==========================================
// // 1. Запитайте у користувача якого він року народження (Наприклад, 1995).
// // 2. Виведіть через alert повідомлення для юзера з інформацією, яка вказує на його вік.
// //Наприклад: "Ваш вік - хх років"

// =================================== 3 ==========================================
// // Запитайтесь в юзера радіус кола та виведіть його площу.
// // Площа круга: PI*r**2
// // число РІ - 3.14
// const PI;

// =================================== 4 ==========================================
// // Визначення відстанні:
// // Середня швидкість їзди юзера - 50 км в годину.
// // 1. Запитайтесь у юзера скільки часу він планує їхати.
// // 2. Виведіть відстань у км, яку юзер проїде за цей час.
// // Наприклад, "Плануєма відстань становить 100 км"

// ==================================== 5 =========================================
// // Юзер має ввести суму коштів, яка є на його картці та ціну за 1 літр бензину на АЗС.
// // Виведіть інфу, яка проінформує скільки бензину він може максимально купити, скільки грошей
// // у нього залишиться та який бонус буде йому нараховано, якщо він є учасником прог. лояльності.
// // Боусація: За кожен оплачений літр бензину користувач отримує нарахування - 2% від вартості.
// let isLoyalty = true;
// const costPetrol;
// const userMaxPrice;

// ==================================== 6 =========================================
// // Напишіть код, який буде запитувати логін за допомогою prompt і логувати результат в консоль.
// // Якщо юзер вводить "Admin", то далі prompt запитує пароль.
// // Якщо нічого не введено або нажата клавіша Esc -  вивести стрічку "Відмінено".
// // Якщо введено пароль "Я головний" - то вивести стрічку "Привіт!"
// // Інакше виводити стрічку "Невірний пароль!"
// const LOGIN = 'Admin';
// const PASSWORD = 'Я головний';
// const loginInput;

//++++++++++++++++++++++++++++++++++++++++++
// const loginInput = prompt("Введите свой логин");

// if (loginInput === "Админ") {
//   const passwordInput = prompt("Введите свой пароль");
//   if (passwordInput) {
//     if (passwordInput === "Я главный") {
//       console.log("Здравствуйте");
//     } else {
//       console.log("Неверный пароль");
//     }
//   } else {
//     console.log("Отменено");
//   }
// }
// }

// ==================================== 7 =========================================
// // Запропонуйте користувачу ввести будь-яке число через prompt.
// // Дані добавляются до значення змінної total.
// // Нюанс: Операція вводу числа продовжується до того часу, поки юзер не натисне "Cancel" в prompt.
// // Після чого потрібно показати alert з повідомленням: "Загальна сума введених чисел: [число]."
// let total = 0;
// let inputValue;
// alert("Загальна сума введених чисел: [число].");

//++++++++++++++++++++++++++++++++++++++++++
// let inputValue = prompt('Введите число');
// let chech = false;
// let total = 0;

// do {
//   if (inputValue) {
//     chech = true;
//     total += Number(inputValue);
//     inputValue = prompt("Введите число");
//   } else {
//     chech = false;
//     alert(`Общая сумма чисел равна${total}`);
//   }
// } while (chech);

// console.log(a);

// {
//   var a = 5;
// }
